# Macro Class

---
An individual Autodesk Revit Macro which can be executed.
SystemObject Autodesk.Revit.DB.MacrosMacro
**Namespace:** Autodesk.Revit.DB.Macros**Assembly:** RevitAPIMacros (in RevitAPIMacros.dll) Version: 26.0.4.0 (26.0.4.0)

    public class Macro : IDisposable

    Public Class Macro
    	Implements IDisposable

    public ref class Macro : IDisposable

    type Macro =
        class
            interface IDisposable
        end
The Macro type exposes the following members.
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
| MacroModule|  The Macro module.
| Name|  The macro name.
Top
| Name| Description
---|---|---
| Dispose| Releases all resources used by the Macro
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| Execute|  Executes the macro.
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Macros Namespace